[
    {
      "name": "Antoine Veillon",
      "summary": "Antoine Veillon is an experienced International Account Manager at MEDIAKEYS, currently leveraging his trilingual abilities (French, Spanish, English) from their Mexico City office. With a solid foundation in digital marketing, project management, and client relations honed at prominent French media companies, Antoine now focuses on managing international client accounts and executing advertising strategies in diverse markets. His certifications in Google Digital Marketing and Google Ads underscore his digital proficiency.",
      "archetype": "The Cultural Compass of Campaigns",
      "archetype_connection_llm_context": "This archetype is fitting because Antoine’s career demonstrates a strong ability to navigate and bridge cultural and linguistic divides. His early international experience in Puebla, Mexico, coupled with his current role managing global campaigns from Mexico City for an international advertising exchange, MEDIAKEYS, showcases his adeptness at guiding campaigns across different cultural landscapes. His trilingual proficiency is a core asset, making him a valuable connection for attendees looking to understand the nuances of international campaign management, particularly in French, Spanish, and English-speaking markets, or those seeking insights into the Mexican/LATAM advertising environment from an international agency perspective. He's ideal for discussions on adapting advertising strategies for global audiences and ensuring campaigns resonate authentically across borders.",
      "profileImageURL": null
    },
    {
      "name": "Ben Poole",
      "summary": "Ben Poole is the Director of Client Development for Australia & New Zealand at Billups, a global OOH specialist managed service. A recognized OOH expert, he co-founded Billie Media, New Zealand's first specialist Outdoor media agency, demonstrating significant entrepreneurial drive and deep knowledge of the OOH landscape. His career includes substantial experience with major OOH players like JCDecaux, and he now focuses on driving growth, innovation, and results for brands in the ANZ region through technology and strategic client development.",
      "archetype": "The OOH Orchestrator of ANZ",
      "archetype_connection_llm_context": "Ben embodies \"The OOH Orchestrator of ANZ\" through his comprehensive leadership in the Out-of-Home sector across Australia and New Zealand. Having co-founded NZ's pioneering OOH specialist agency (Billie Media) and now directing client development for Billups (a company \"reinventing OOH planning and placement for the performance age\"), he's adept at harmonizing all elements of OOH campaigns – from strategy and innovation to execution and client results. Attendees looking to understand the ANZ OOH market, seeking expertise in OOH strategy, or interested in founding/scaling specialist media agencies would find Ben invaluable. His work at Billups, which \"blends art and science\" with \"AI-powered recommendation engines,\" makes him relevant for discussions on technology's role in modern OOH.",
      "profileImageURL": "/profile-photos/ben-poole.jpg"
    },
    {
      "name": "Chris Cowlbeck",
      "summary": "Chris Cowlbeck serves as Chief Vision Officer at IBOUSA, a network championing independent billboard operators primarily in smaller US markets. With a rich background that spans over a decade in OOH marketing, construction, and real estate, Chris is dedicated to enhancing revenue for IBOUSA members. He's at the forefront of integrating advanced technologies like AI, machine learning, and satellite imagery for OOH location selection and analytics. His influential roles, including OOH Chairman at the Media Rating Council (MRC), highlight his commitment to advancing industry standards.",
      "archetype": "The Indie Billboard Shepherd & Tech Sage",
      "archetype_connection_llm_context": "Chris is the \"Indie Billboard Shepherd\" as he nurtures and guides the IBOUSA network of independent OOH operators, focusing on their growth and technological empowerment. He's also a \"Tech Sage\" due to his pioneering efforts to integrate AI, machine learning with satellite imagery for OOH, and developing cloud-based analytics, alongside his influential role in the Media Rating Council establishing OOH traffic metric standards. He's a key contact for independent billboard owners looking to leverage technology, understand OOH metrics and standards, or network with peers. Tech companies developing solutions for OOH, especially for independent operators or in data/AI, would also benefit from his insights. His passion is clear: \"Networking Independent Media Owners\" and bringing them cutting-edge tools.",
      "profileImageURL": null
    },
    {
      "name": "David Weinfeld",
      "summary": "David Weinfeld is a serial entrepreneur and the Co-Founder & CEO of Screenverse, a company specializing in advertising management and monetization for digital screen networks with a programmatic focus. His career is marked by senior roles in digital strategy, marketing, and business development (e.g., scaling Vistar Media's SSP business). David possesses deep expertise in DOOH, programmatic advertising, mobile, and social media, with a strong track record of building successful AdTech ventures and driving revenue growth for over 100,000 screens nationwide.",
      "archetype": "The DOOH Monetization Maverick",
      "archetype_connection_llm_context": "David is a \"DOOH Monetization Maverick\" because his career is defined by boldly founding and leading companies (Screenverse, Kismyt, WA Media Group) that create new pathways to generate revenue from digital screens. His success at Vistar Media, growing the SSP and DOOH software business from $0 to significant ARR, and now leading Screenverse (\"One of the largest networks of digital screens in the physical world\") to deliver programmatic revenue, exemplifies this. He's an ideal match for those interested in programmatic DOOH, monetizing digital screen networks, AdTech entrepreneurship, or understanding the evolving DOOH landscape. His focus is on \"delivering programmatic revenue to a vast network of screens,\" making him a go-to for discussions on scaling DOOH advertising.",
      "profileImageURL": "/profile-photos/dweinfeld.jpg"
    },
    {
      "name": "Eduardo Escalante",
      "summary": "Eduardo Escalante is a results-oriented Regional Sales Manager for Grupo Publimovil, with extensive experience driving sales and business development across Central America. His career highlights include significantly expanding operations and achieving consistent sales growth (15-20% over 5 years) for Grupo Dutriz El Salvador, including opening their Guatemala office. Eduardo excels in market analysis, strategic planning, team leadership, and is now enhancing his business acumen with certifications in Programmatic DOOH, showing a commitment to evolving media trends.",
      "archetype": "The Central American Market Cultivator",
      "archetype_connection_llm_context": "Eduardo perfectly fits \"The Central American Market Cultivator\" due to his proven success in nurturing and expanding business operations throughout this specific region. His achievements, like opening and developing the Grupo Dutriz Guatemala office (achieving 65% sales growth there) and consistently growing sales across Central America and Panama, demonstrate his ability to cultivate markets and make them flourish. He's a prime contact for anyone looking to understand or enter the Central American media and advertising landscape, seeking advice on regional sales strategies, team leadership in emerging markets, or adapting to new technologies like Programmatic DOOH within this context. His focus is on \"leading the regional sales organization to exceed sales plans and achieve objectives\" in Central America.",
      "profileImageURL": null
    },
    {
      "name": "Emeline Domingues",
      "summary": "No profile data was provided for Emeline Domingues.",
      "archetype": "The Phantom of the Profile",
      "archetype_connection_llm_context": "This individual remains a mystery, with no information available to create a summary or assign a more specific archetype. If Emeline is present at the conference, attendees will have the unique opportunity to discover her expertise firsthand.",
      "profileImageURL": null
    },
    {
      "name": "Henrietta Shakespeare",
      "summary": "Henrietta Shakespeare is a highly experienced strategic leader, set to become Chief of Staff at BackLite Media in Dubai. With over two decades in business development and outdoor advertising (including extensive time at Clear Channel International), she excels in project management, commercial planning, and change management. Her international career has seen her launch profitable consultancy practices and manage key partnerships across MENA, Asia, and the UK, consistently focused on delivering sustainable value and transformative results in the OOH sector.",
      "archetype": "The Global OOH Growth Alchemist",
      "archetype_connection_llm_context": "Henrietta is \"The Global OOH Growth Alchemist\" because she transforms OOH opportunities into strategic gold across diverse international markets (MENA, Asia, UK). Her impressive career at Clear Channel International (Head of MENA & Asia Partnerships, Head of MENA from UK), managing P&L, tenders, and launching consultancy services, showcases her ability to cultivate growth. Her upcoming Chief of Staff role at BackLite Media (UAE's \"most Desirable media brand\") and background blending a Biochemistry degree with Stanford GSB business education further highlight her transformative approach. She's ideal for discussions on international OOH strategy, market entry in MENA/Asia, operational excellence, and high-level partnership management.",
      "profileImageURL": "/profile-photos/henrietta-shakespeare.jpg"
    },
    {
      "name": "Jeff R. Lamb",
      "summary": "Jeff R. Lamb is the long-serving CTO (or \"Nerd\") at DOmedia, where he was the original architect of all its technology, fundamentally shaping how OOH media is bought and sold. A serial entrepreneur (Founder of QStart Labs, launched 42+ web businesses), decorated former US Air Force Intelligence Officer (Captain), and inventor on a data management patent, Jeff has a profound ability to bridge complex business needs with innovative technological solutions. His career is dedicated to technological leadership and pioneering web-based business development.",
      "archetype": "The OOH Code Commander (and Chief Nerd)",
      "archetype_connection_llm_context": "Jeff is unequivocally \"The OOH Code Commander\" as the original architect and ultimate lead for all technology at DOmedia, a company transforming OOH media buying/selling. His self-proclaimed \"Nerd\" title embraces his deep technical expertise. His history founding QStart Labs (launching over 42 web businesses), his patent, and his decorated service as an Air Force Intelligence Officer specializing in overhead imagery all point to a commander of complex technical systems. He's a match for those interested in the technological underpinnings of OOH platforms, AdTech innovation, entrepreneurship in tech, or how to translate business challenges into scalable tech solutions. His focus is on \"changing how Out-of-Home (OOH) media is bought and sold\" through technology.",
      "profileImageURL": "/profile-photos/jeffrlamb.jpg"
    },
    {
      "name": "Katie Burwell",
      "summary": "Katie Burwell is the Director of Supply Growth at AdQuick.com, a leading platform for purchasing and measuring OOH advertising. She focuses on strategically expanding AdQuick's network of OOH media partners, drawing on her prior experience in client success and sales engineering at DOmedia. With a background in communications and a commitment to leadership development (Highrise Leadership Impact Program), Katie is dedicated to making OOH advertising more accessible, transparent, and measurable for marketers.",
      "archetype": "The OOH Supply Chain Connector",
      "archetype_connection_llm_context": "Katie is \"The OOH Supply Chain Connector\" as her primary role at AdQuick (\"the easiest way to plan, book, and measure out-of-home advertising\") is to build and expand the network of media owners (the supply side) and connect them seamlessly to advertisers via the platform. Her progression from sales engineering and client success at DOmedia to leading supply growth at AdQuick demonstrates her expertise in bridging these critical parts of the OOH ecosystem. She's a key contact for media owners looking to integrate with AdTech platforms, advertisers seeking to understand OOH inventory access, or anyone interested in the operational aspects of OOH marketplaces. Her goal is to \"expand AdQuick's OOH media supply network.\""
    },
    {
      "name": "Kyle Gray",
      "summary": "Kyle Gray is the passionate Commercial Director at Polygon, a programmatic digital-out-of-home (pDOOH) aggregated publisher network focusing on Africa. With a strong background in digital media sales and business development (Mark1 Media, Entravision Africa), Kyle is driven to empower brands with unforgettable pDOOH experiences that bridge real-world engagement with digital conversions. He leverages strategic thinking and cutting-edge technologies to elevate brand visibility across Polygon's extensive network of screens. His future start date as Commercial Director builds on his current Head of Growth role.",
      "archetype": "The pDOOH Passion Catalyst of Africa",
      "archetype_connection_llm_context": "Kyle's headline (\"Passionate pDOOH Enthusiast\") and his role at Polygon (\"A programmatic digital-out-of-home aggregated publisher network focusing on global venues, screens and audiences\" with a strong African presence) firmly establish him as \"The pDOOH Passion Catalyst of Africa.\" He doesn't just work in pDOOH; he's an evangelist for it, aiming to bridge real-world impact with digital results. His award-winning sales background and experience at companies like Mark1 Media and Entravision Africa further cement his expertise in driving growth in this specific, dynamic market. He's ideal for conversations about pDOOH opportunities in Africa, programmatic strategies, or connecting with a network of digital screens across the continent.",
      "profileImageURL": "/profile-photos/kyle-gray.jpg"
    },
    {
      "name": "Marios Georgakopoulos",
      "summary": "Marios Georgakopoulos is an intrapreneurial New Business & Transformation Manager at Politis Group, a major Greek media and advertising firm. He leads key innovation projects leveraging technology and data for OOH, including a Location Intelligence Study (L.I.S.), an OOH Gate (GOOH), and a Media Advanced Selection Tool (MAST). With an MBA, a Law degree, and recent certifications in AI and Generative AI, Marios combines strategic business acumen with a drive for digital transformation within the OOH sector.",
      "archetype": "The OOH Innovation Intrapreneur",
      "archetype_connection_llm_context": "Marios is an \"OOH Innovation Intrapreneur\" because he drives new ventures and technological advancements from within Politis Group, a large established firm. His spearheading of projects like L.I.S. (using Vodafone Analytics, Carto, TomTom for post-campaign OOH analysis), MAST (an advanced OOH selection tool), and GOOH, alongside his \"Intrapreneur by habit\" headline and recent high-level AI certifications (Databricks, DeepLearning.AI, Google Cloud), all point to his role in building the future of OOH from the inside. He's perfect for discussions on OOH data analytics, location intelligence, AI applications in media, and fostering innovation within corporate structures, especially in the Greek/European context.",
      "profileImageURL": "/profile-photos/mariosgeorgakopoulos.jpg"
    },
    {
      "name": "Mitchell Wade",
      "summary": "Mitchell Wade is the SVP of North America for Quividi, a global leader in AI & Computer-Vision based platforms for real-time audience measurement in DOOH and Retail Media. With over 20 years in tech sales leadership (including ViSenze, Ingram Micro, Kodak, HP), he's passionate about delivering solutions that provide actionable insights for these markets. Mitchell has a proven track record of building and leading sales teams, driving revenue growth, and successfully launching and scaling operations for tech companies in North America, including a previous successful tenure at Quividi.",
      "archetype": "The Visionary of Venue Intelligence",
      "archetype_connection_llm_context": "Mitchell is \"The Visionary of Venue Intelligence\" because his work at Quividi (\"World's #1 in providing real-time audience measurement & shopper engagement for DOOH and Retail\") empowers businesses to truly \"see\" and understand their audiences in physical spaces. His extensive experience leading North American sales for AI/Computer Vision tech companies (like ViSenze - \"AI for Visual Commerce\") demonstrates his focus on translating visual data into actionable business intelligence for retail and DOOH environments. He's a key contact for those interested in audience measurement, retail analytics, DOOH effectiveness, AI/Computer Vision applications, or scaling tech solutions in the North American market.",
      "profileImageURL": "/profile-photos/mcwaday.jpg"
    },
    {
      "name": "Neil Morris",
      "summary": "Neil Morris is a renowned innovator and serial entrepreneur in advertising creative services, celebrated as a pioneer in creativity for Digital Out-of-Home (DOOH). He founded and successfully exited Grand Visual (leading DOOH creative agency) and QDOT (DOOH campaign management platform), both acquired by Talon Outdoor. Currently, Neil is the Founder of Super Optimal, a tech platform leveraging AI and machine learning for OOH ad design intelligence. His career is defined by building groundbreaking, award-winning businesses that shape the DOOH landscape.",
      "archetype": "The DOOH Creative Alchemist & Serial Tech Shaper",
      "archetype_connection_llm_context": "Neil is a \"DOOH Creative Alchemist\" for his pioneering work with Grand Visual, transforming creative ideas into groundbreaking DOOH campaigns. He's a \"Serial Tech Shaper\" because he repeatedly founds (Grand Visual, QDOT, Super Optimal, Junction 7) and builds technology-driven businesses that define and advance the OOH/DOOH industry. His current venture, Super Optimal (\"Design intelligence for OOH\" using AI/ML), continues this legacy. He's the ideal person to talk to about DOOH creative best practices, AdTech entrepreneurship, AI in advertising creative, building and scaling OOH tech businesses, and the future of OOH design. His track record of successful exits makes him a fount of knowledge on business creation and innovation.",
      "profileImageURL": "/profile-photos/neiljmorris.jpg"
    },
    {
      "name": "Paola Gonzalez",
      "summary": "Paola Gonzalez is the Global Marketing Communications Manager at Iridex, a medical device company, where she is set to take on this expanded role. Her background includes strong B2B/B2C sales and marketing experience, particularly in LATAM markets from her time at ROCOL SA (managing 40+ LATAM trade shows annually) and Alpina. Paola excels in digital marketing (Salesforce, HubSpot, Ads), project management, and product launches, combining detail-orientation with creative problem-solving. Her current global role builds on her prior specialist responsibilities managing global promotional activities and the Iridex Academy Webinar Series.",
      "archetype": "The Global MarCom Bridge-Builder (MedTech Edition)",
      "archetype_connection_llm_context": "Paola is \"The Global MarCom Bridge-Builder (MedTech Edition)\" as she connects Iridex (a medical equipment manufacturer) with its worldwide audience through strategic marketing communications. Her experience managing extensive trade show presence across LATAM for ROCOL SA and now her global responsibilities at Iridex (implementing digital strategies, orchestrating international product launches, supporting worldwide field teams) highlight her role in building these crucial communication bridges. Her MedTech specialization is key. She's a match for discussions on global marketing in specialized industries, LATAM market entry/engagement, digital marketing for B2B, and managing international product launches.",
      "profileImageURL": "/profile-photos/paola-a-gonzalez.jpg"
    },
    {
      "name": "Rohan Prasad",
      "summary": "Rohan Prasad is a dynamic Director of Client Development for Australia & New Zealand at Billups, a leading OOH advertising technology and managed services company. He co-founded Billie Media, New Zealand's first OOH specialist agency, alongside Ben Poole, showcasing his entrepreneurial spirit and deep OOH expertise. His career includes significant roles at JCDecaux (Account Director) and FCB New Zealand (Digital Account Manager, Digital Buyer), giving him a strong foundation in both OOH and digital marketing execution within the ANZ region.",
      "archetype": "The ANZ OOH Campaign Navigator",
      "archetype_connection_llm_context": "Rohan is \"The ANZ OOH Campaign Navigator\" because he expertly guides clients through the complexities of OOH advertising in the Australia & New Zealand markets. His experience co-founding Billie Media (NZ's first OOH specialist agency), combined with his roles at JCDecaux and now Billups (\"Out-of-Home advertising for the performance age\"), shows his ability to chart successful courses for OOH campaigns. His digital marketing background (Volkswagen NZ, FCB NZ) adds another layer to his navigational skills, integrating OOH with broader strategies. He's ideal for those seeking insights into the ANZ OOH/digital landscape, agency founding, or effective OOH campaign strategy and execution in the region.",
      "profileImageURL": "/profile-photos/rohan-prasad.jpg"
    },
    {
      "name": "Santiago Mendive",
      "summary": "Santiago Mendive is the Co-Founder & CEO of Taggify, a pioneering Programmatic Digital Out-of-Home (pDOOH) platform with a strong presence in LATAM. Since taking the helm in 2017, he has driven Taggify's vision, achieving significant growth and global expansion. Santiago has an extensive leadership background in marketing, sales, and media, with senior roles at Editorial Atlantida/Televisa, Omnicom Group, and brand management at Gillette and Coca-Cola, giving him deep insights into advertising's evolution towards programmatic OOH.",
      "archetype": "The Programmatic Pioneer of the Pampas (and Beyond)",
      "archetype_connection_llm_context": "Santiago is \"The Programmatic Pioneer of the Pampas (and Beyond)\" as the CEO and Co-Founder of Taggify (\"The first Programmatic Out-Of-Home (pDOOH) Platform in LATAM\"), headquartered in Buenos Aires (the Pampas region). He is leading the charge in bringing programmatic capabilities to the OOH industry across Latin America and expanding globally. His rich history with major media houses (Televisa) and global brands (Coca-Cola, Gillette) before venturing into AdTech gives him unique perspective. He's a key connection for anyone interested in pDOOH in LATAM, AdTech entrepreneurship, or the transition of traditional media to programmatic models. His focus is on maximizing client ROI through Taggify's data-driven pDOOH solution.",
      "profileImageURL": "/profile-photos/santiago-mendive.jpg"
    },
    {
      "name": "Simon Wall",
      "summary": "Simon Wall is the Group CEO and a founding shareholder of Tractor Media Holdings, a leading independent media group in South Africa specializing in technology-driven Digital Out-of-Home (DOOH). With nearly 20 years in marketing and OOH, Simon drives strategic innovation across a diverse portfolio including Tractor Outdoor, programmatic network Polygon, Innovocean (V&A Waterfront), Mischief (activations), and BMT (LED solutions). He's a passionate advocate for technology in OOH, with extensive experience in South African and international markets.",
      "archetype": "The Capetonian Kingpin of Outdoor Innovation",
      "archetype_connection_llm_context": "Simon is \"The Capetonian Kingpin of Outdoor Innovation\" as the Cape Town-based Group CEO who has built Tractor Media Holdings into one of South Africa's largest independent media companies, with a strong focus on DOOH and tech. His extensive portfolio (Tractor Outdoor, Polygon pDOOH network, Innovocean, Mischief, BMT) demonstrates his leadership and influence (\"Kingpin\") in shaping the OOH landscape through innovative, technology-driven solutions. His early venture, POP Media (SA's first mall-focused media sales house), also underscores his innovative spirit. He's ideal for discussions on OOH/DOOH in South Africa/Africa, media entrepreneurship, integrating technology in OOH, and building a diversified media group.",
      "profileImageURL": "/profile-photos/simon-wall.jpg"
    },
    {
      "name": "Stephany Carroll",
      "summary": "Stephany Carroll is the Director of Business Operations at BillboardHub, an Eastern Canadian OOH advertising platform, where she is poised to step into this role after significant contributions as Operations Manager and Marketing Executive. Her headline, \"Chief Problem-Solver | Operations Ninja,\", aptly describes her focus on streamlining processes and driving strategic growth. With a background as a Business Analyst at Labatt Breweries and education in Marketing and Graphic Design, Stephany combines analytical rigor with creative thinking to optimize workflows, integrate CRMs, and enhance operational efficiency for growing businesses.",
      "archetype": "The Operations Optimizer & Process Whisperer",
      "archetype_connection_llm_context": "Stephany's archetype, \"The Operations Optimizer & Process Whisperer,\" is directly reflected in her self-described role as \"Chief Problem-Solver | Operations Ninja | Streamlining the Chaos, One Process at a Time\" and her responsibilities at BillboardHub (process optimization through automation, CRM, invoicing, workflow management). Her journey from Business Analyst at Labatt to leading operations at a startup like BillboardHub (\"Empowering advertisers and vendors in Eastern Canada\") shows her skill in taming complexity and building efficient systems. She's a great match for startups or SMEs needing advice on operational efficiency, CRM implementation, workflow automation, or bridging marketing and operations, especially in the Canadian context.",
      "profileImageURL": "/profile-photos/stephany-k-carroll.jpg"
    }
  ]